#include <stdio.h>
#include <stdbool.h>

/**

 * @file lab62.c
 * @brief Файл з другим завданням з лабораторної роботи №6
 * "Заповнити масив із заданої кількості елементів простими числами, що не повторюються. Розмір вихідного масиву задати наперед відомим значенням, що може будуть більшим аніж результуюча кількість отриманих елементів"
 * @author Ermakov Matthew.
 * @date 31-nov-2020
 * @version 0.1

*/

/**
 
 * @brief Функція заповнення масиву заданої довжини простими числами
 * @param Одне ціле число
 * @return Логічну відповідь у консоль

*/

void primeMass(int arrLength){
    
    //обьявление массива и его длинны
    int arr[arrLength];
	
        //значение, которое в ходе цикла и условий будет преобретать значение простого числа 
        int value = 1;

        for (int i = 0; i < arrLength; i++)
        {
        
            //переменная, обозначающая есть ли число простым. Если нет, то в цикле do...while будет выполняться сравнение до тех пор, пока число в переменной value не станет простым 
            bool prime = true;
            
            do{
            
                ++value;
                
                for (int j = 0; j < i && arr[j] <= value / 2 && (prime = value % arr[j] != 0); ++j);
                
            } while (!prime);

	    //записываем результат в каждый элемент массива arr[15]
            arr[i] = value;
            
        }

    //выводим массив
    for (int i = 0; i < arrLength; i++)
    {
        printf("%d ", arr[i]);
    }
    
}

int main(){

    //вызываем функцию с аргументом 6
    primeMass(6);

    return 0;
        
}


