#include <stdarg.h> 
#include <stdio.h> 

/**

 * @file supEx.c
 * @brief Файл з завданням на "відмінно" з лабораторної роботи №7
 * "Реалізувати функцію, що визначає, скільки серед заданої послідовності чисел таких пар, у котрих перше число менше наступного, використовуючи функцію з варіативною кількістю аргументів"
 * @author Ermakov Matthew.
 * @date 12-dec-2020
 * @version 0.1

*/

/**
 
 * @brief Функція з підрахунку послідовності пар чисел, у котрих перше число менше наступного
 * @param Одне ціле число й нескінченно багато інших двозначних чисел
 * @return Змінну "с"

*/


double howMany(int count, ...) { 

    //заносим вариативные числа в переменную "ap"
    va_list ap; 
    int j; 
    
    //инициализируем перменную "ap" и "count"
    va_start(ap, count);
    int c = 0;
   
    //перебираем каждое число из перeменной "ap" с помощью функции va_arg()
    for (j = 0; j < count; j++) { 

        int fN = va_arg(ap, int)%10;
        int sN = (va_arg(ap, int) - fN)/10;

        if(fN>sN) {
            c++;
        }
    } 

    va_end(ap); 

    //возвращаем количество чисел
    return c; 
    
} 
    
int main() { 
    double result = howMany(10, 12, 13, 14, 15, 16, 34, 65, 67, 87, 89);    

    printf("%f\n", result); //выводим переменную результата функции

    return 0;

} 
