#include <stdio.h>

int main(){
	
	int numberQuantity = 1; //кол-во цифр в числе
	
	int begNum = 543; //искомое число
	
	char * mass[4][9] = {
		{"тысяча", "две",  "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
		{"сто", "двести", "триста", "честыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"},
		{"десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "восемьдесят", "девяносто"},
		{"один", "два",  "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"}
	};
	
	//считаем кол-во цифр в begNum и плюсуем к переменной numberQuantity
	while ((begNum/=10) > 0){
	
		numberQuantity++;
	
	}
	
	if(numberQuantity == 4){
	
		
	
	}else if(numberQuantity == 3){
	
	
	}else if(numberQuantity == 2){
	
	
	}else if(numberQuantity == 1){
	
	
	}else{
	
		
	
	}
	
}
